[
 {
   "Columns Name": "loan_id",
   "Description": "The \"loan_id\" column serves as a unique identifier in loan management systems and financial applications, used to distinguish individual loans in a database table. It ensures data integrity and enables easy access to specific loan details. Typically set as non-null, unique, and indexed, the \"loan_id\" often acts as a primary key, enforcing data uniqueness and facilitating relationships with related records in the database.",
   "Data Type": "int",
   "Data Model Type": "Identifier",
   "is PII": "no",
   "alias names": "id"
 },
 {
   "Columns Name": "disbursed_amount",
   "Description": "The \"loan disbursed amount\" column in a database table stores the actual money granted to a borrower as part of a loan agreement. It is crucial for loan management systems and financial applications, tracking the specific amount disbursed. This column includes attributes like data type and precision, often numeric, to handle monetary values accurately. It helps financial institutions monitor loan progress, repayments, and outstanding balances, supporting financial calculations and regulatory compliance while ensuring transparency in transactions.",
   "Data Type": "Decimal(22,8)",
   "Data Model Type": "Metric",
   "is PII": "no",
   "alias names": "disbursed amount, Given amount, disbursed"
 },
 {
   "Columns Name": "tenure",
   "Description": "The \"loan tenure\" column in a database table stores the duration of a loan, representing the time for borrowers to repay it. It influences installment amounts, interest calculations, and loan terms. The tenure can be in months or years, determined during the loan application process based on factors like creditworthiness and loan amount. Longer tenures offer lower monthly payments but higher overall interest, while shorter tenures have higher monthly payments and lower interest costs. This column is essential for effective loan monitoring and management, enabling tracking of repayment schedules and ensuring compliance with loan terms.",
   "Data Type": "Integer",
   "Data Model Type": "Dimension",
   "is PII": "no",
   "alias names": "loan tenure, loan period"
 },
 {
   "Columns Name": "interest_rate",
   "Description": "Annual percentage rate (APR) refers to the yearly interest generated by a sum that's charged to borrowers or paid to investors. APR is expressed as a percentage that represents the actual yearly cost of funds over the term of a loan or income earned on an investment. This includes any fees or additional costs associated with the transaction but does not take compounding into account. The APR provides consumers with a bottom-line number they can compare among lenders, credit cards, or investment products",
   "Data Type": "Float",
   "Data Model Type": "Dimension, Metric",
   "is PII": "no",
   "alias names": "ROI, APR"
 },
 {
   "Columns Name": "product_code",
   "Description": "The \"loan product code\" column in a database table holds a unique identifier for specific loan types offered by a financial institution. It contains a combination of letters and numbers for easy identification. This column streamlines loan management, simplifies product categorization, and facilitates efficient loan processing. It enables quick identification of loan products for loan officers and administrators, contributing to effective loan management and marketing. The \"loan product code\" enhances loan product tracking and supports customer service, ensuring smooth loan operations within the financial institution.",
   "Data Type": "String",
   "Data Model Type": "Dimension",
   "is PII": "no",
   "alias names": "type of product, product name, product"
 },
 {
   "Columns Name": "state",
   "Description": "The \"loan disbursed geo state\" column in a database table stores the geographical state or location where a loan is granted to a borrower. It holds two-letter state abbreviations or specific codes, enabling monitoring of loans across regions, compliance, and generating state-specific reports. This column facilitates loan analysis based on geographic factors, offers insights into the lending institution's reach, and aids in identifying growth areas. It plays a vital role in effective loan management, ensuring compliance, and improving decision-making and customer service within the financial institution.",
   "Data Type": "String",
   "Data Model Type": "Dimension",
   "is PII": "no",
   "alias names": "geo state, indian state"
 },
 {
   "Columns Name": "disbursed_at",
   "Description": "The \"loan disbursed date and time\" column in a database table records the exact date and time of loan disbursement to borrowers. It is critical for transaction records, determining loan start dates, complying with regulations, and enabling reporting and analysis. This column ensures transparency and efficiency in loan processing, facilitating coordination within the financial institution and adherence to legal standards.",
   "Data Type": "Timestamp",
   "Data Model Type": "Dimension",
   "is PII": "no",
   "alias names": "disbursed at, when is the loan disbursed"
 }
]
